app/Http/Helpers/helpers.php

select * from `languages` where `status` = 1 limit 1
---
function selectedLangDir()
{
    if (session()->get('local')) {
        $default_language = Language::where('code', session()->get('local'))->first();
        $default_language_dir = $default_language->dir ?? LanguageConst::NOT_REMOVABLE;
    } else {
        $default_language = Language::where('status', GlobalConst::ACTIVE)->first();